Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm (LSTM)                 (None, 100)               52400     
                                                                 
 dense (Dense)               (None, 1)                 101       
                                                                 
=================================================================
Total params: 52501 (205.08 KB)
Trainable params: 52501 (205.08 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________